<template>
    <article>
        <header>
            <h2 v-text="article.title"></h2>
        </header>
        <main v-html="article.comput_content ">
        </main>
        <footer>
            <span class="continue_reading">
                阅读更多
            </span>
            <div class="article_info">
                <div>
                    <svg t="1658394755012" class="icon" viewBox="0 0 1024 1024" version="1.1"
                        xmlns="http://www.w3.org/2000/svg" p-id="2070" width="200" height="200">
                        <path
                            d="M896 448H128v447.957333l477.738667 0.021334L896 895.957333V448z m0-42.666667V192.042667C896 192 768 192 768 192V149.333333h128.042667A42.666667 42.666667 0 0 1 938.666667 192.042667v703.914666A42.624 42.624 0 0 1 896.064 938.666667H127.936A42.666667 42.666667 0 0 1 85.333333 895.957333V192.042667C85.333333 168.469333 104.256 149.333333 127.957333 149.333333H256v42.666667l-128 0.042667V405.333333h768zM298.666667 85.333333h42.666666v170.666667h-42.666666V85.333333z m384 0h42.666666v170.666667h-42.666666V85.333333zM384 149.333333h256v42.666667H384V149.333333z"
                            p-id="2071"></path>
                    </svg>
                    <span v-text="article.createTime"></span>
                </div>
                <div>
                    <svg t="1658395131742" class="icon" viewBox="0 0 1024 1024" version="1.1"
                        xmlns="http://www.w3.org/2000/svg" p-id="3995" width="200" height="200">
                        <path
                            d="M122.065592 200.99371m-51.776224 0a50.597 50.597 0 1 0 103.552447 0 50.597 50.597 0 1 0-103.552447 0Z"
                            p-id="3996"></path>
                        <path
                            d="M122.065592 459.888132c-28.593222 0-51.776224 23.171746-51.776224 51.763944 0 28.605501 23.183002 51.774177 51.776224 51.774177 28.593222 0 51.777247-23.167652 51.777247-51.774177C173.841815 483.059877 150.658813 459.888132 122.065592 459.888132z"
                            p-id="3997"></path>
                        <path
                            d="M122.065592 770.535241c-28.593222 0-51.776224 23.183002-51.776224 51.776224 0 28.609595 23.183002 51.788503 51.776224 51.788503 28.593222 0 51.777247-23.178909 51.777247-51.788503C173.841815 793.718243 150.658813 770.535241 122.065592 770.535241z"
                            p-id="3998"></path>
                        <path d="M251.505639 796.424888l698.980555 0 0 51.776224-698.980555 0 0-51.776224Z" p-id="3999">
                        </path>
                        <path d="M251.505639 485.765499l698.980555 0 0 51.7752-698.980555 0 0-51.7752Z" p-id="4000">
                        </path>
                        <path d="M251.505639 175.105087l698.980555 0 0 51.777247-698.980555 0 0-51.777247Z" p-id="4001">
                        </path>
                    </svg>
                    <span v-text="article.category"></span>
                </div>
                <div v-if="article.tags && article.tags.length > 0">
                    <svg t="1658395630613" class="icon" viewBox="0 0 1024 1024" version="1.1"
                        xmlns="http://www.w3.org/2000/svg" p-id="4912" width="200" height="200">
                        <path
                            d="M979.067648 415.512459c0 0 0.040932-300.381301 0.040932-303.553551 0-39.417755-32.060183-71.477938-71.477938-71.477938-3.172249 0-303.543318 0.040932-303.533085 0.040932-2.128477 0-4.256954-0.010233-6.364965-0.020466-2.241041-0.010233-4.461615-0.020466-6.671956-0.020466-19.893072 0-49.947576 0-69.615521 19.657712l-463.772602 463.782835c-11.164271 11.143805-17.304108 25.971511-17.304108 41.750893 0 15.769149 6.139837 30.596855 17.293875 41.761126l354.503966 354.493733c11.143805 11.154038 25.971511 17.304108 41.750893 17.304108 15.779382 0 30.607088-6.139837 41.761126-17.293875l463.762369-463.782835c19.882839-19.862373 19.770276-48.433082 19.647479-76.052117C979.077881 419.922908 979.067648 417.7228 979.067648 415.512459zM938.155866 422.276513c0.092098 20.107967 0.163729 39.110763-7.65433 46.918589l-463.772602 463.793068c-3.417843 3.428076-7.971555 5.310959-12.811794 5.310959-4.830005 0-9.373485-1.882883-12.791327-5.310959l-354.514199-354.503966c-3.428076-3.428076-5.310959-7.971555-5.310959-12.811794s1.882883-9.373485 5.310959-12.801561l463.782835-463.782835c7.081279-7.081279 23.976064-7.674796 40.666188-7.674796 2.148943 0 4.308119 0.010233 6.487761 0.020466 2.169409 0.010233 4.349051 0.020466 6.54916 0.020466 0 0 300.360835-0.040932 303.533085-0.040932 16.84362 0 30.54569 13.70207 30.54569 30.54569 0 3.172249-0.040932 303.553551-0.040932 303.553551C938.1354 417.784198 938.145633 420.035472 938.155866 422.276513z"
                            p-id="4913"></path>
                        <path
                            d="M859.83201 220.122373c-10.478655 4.246721-22.410406-0.808412-26.657126-11.276834-2.046612-5.0449-5.055133-9.578146-8.953929-13.46671-7.705496-7.705496-17.938558-11.941983-28.836769-11.941983-10.877745 0-21.110807 4.236488-28.795836 11.93175-15.891945 15.891945-15.881712 41.750893 0.010233 57.642838 15.871479 15.881712 41.730427 15.881712 57.622372 0 7.992021-7.992021 20.957311-7.992021 28.939099 0.010233 7.992021 7.992021 7.992021 20.957311-0.010233 28.939099-15.922644 15.912411-36.839023 23.873734-57.745169 23.873734-20.926612 0-41.832757-7.961322-57.755402-23.873734-31.845289-31.855522-31.855522-83.675748-0.020466-115.53127 15.421224-15.431457 35.938514-23.924899 57.755402-23.924899 21.827121 0 42.34441 8.493441 57.775868 23.924899 7.78736 7.78736 13.824867 16.884552 17.938558 27.03575C875.345332 203.933669 870.300432 215.875652 859.83201 220.122373z"
                            p-id="4914"></path>
                    </svg>
                    <span v-for="tag in article.tags" :key="new Date().getTime()" v-text="tag"></span>
                </div>
            </div>
        </footer>
    </article>
</template>
<script setup>
import { reactive, toRefs, computed } from 'vue';
const data = reactive({
    article: {
        title: "二逼日记",
        content: `<p >我有个朋友叫小强，是我初中同学。中考之后我考上了市里的高中，他则留在了乡里。因为我要住校，一个月才能回一次家，因此联络越来越少。前几天听说他因为&ldquo;男女交往过密&rdquo;的罪名被学校政教处处罚了，为此他还病了一场。我放假回家的时候特地去探望了一下小强。见到小强时，我们还和以前一样相谈甚欢，他给我看了这段时间写的一些日记，内容多处语法错乱语义不明，他在这段日子的心理状态可见一斑。我问他能不能把这些日记发到我们学校的校报上？他回答说没问题。我说那你给起个名字吧！他说，这事儿挺二的，就叫二逼日记吧！我于是略作修改，隐去关键的人物姓名和时间地点，其余均原文奉上。</p><br>
<h3>一</h3>
<p>今天语文课时，讲的是《祝福》。我翻了翻前几日托人帮我买的《鲁迅全集》。我突然想起，这帮我买这本书的人就是一个女生。于是我心里一直难以平静，不知道有没有人知道，会不会被处分？我几乎一整节课都在走神。</p>
<h3>二</h3>
<p >今天中午打饭时，我照例排在六号窗口。我看到前面有一男一女牵着手在排队。后面一个老师在巡视，两人马上站开距离，我不知道他们为何突然这样，不过我隐约觉得他们是幸运的。我又想起了那个夜晚，虽然事情已经过去几天了，但是我却一直无法释怀。我不知道为什么跟女生走夜路会违反纪律。我不明白，我实在想不通！不过我觉得，既然老师说不行，那就不行吧！我开始减少与女生的接触，我警觉得有理。</p>
<h3>三</h3>
<p >无月的夜，我与一名女生牵着手走在少人的校道上。我觉得有点惊异。因为我完全不清楚自己是从哪里过来的。或许是从教室吧，我想。还有我身边的女子，她是谁？我看向她的脸，但是无论我如何努力，却始终无法看清她的脸。我可能近视了，明天得去配一副眼镜了。突然，一个红衣男子出现在我们面前，他严厉地说，不行！快放开那个女孩。我说，什么？他说，你们不能在一起！女生说，为什么？那男子面无表情地抬起右手，我看到他手中拿着一支手枪，他扣动了扳机。我感觉到四周的一切都静止了，只见一颗银色的子弹从他的枪口缓缓射出，进入那女生的右眼。接着那女生倒地，她的脑浆和鲜血溅了我一脸。我想大叫，却感觉自己的喉咙好像塞满了棉花，怎样也发不出声，我转头看向那个红衣男子，同样也是一张模糊不清的脸。然后发现四周的一切也开始模糊不清&hellip;&hellip;我惊醒了，原来只是一个梦。我摸了摸自己的脸，冷冰冰的，头发已经被汗水浸湿了。这真的只是一个梦？</p>
<h3>四</h3>
<p >我坐在座位上，看着班上女同学个个都笑得花枝招展的。但是我却觉得那笑容无比狰狞。那是在嘲笑我吗？肯定是的，不然她们何以笑的那么狰狞？虽然我已经尽量避免与女生接触了，但不知她们是不是有意的，非要和我说话，和我同行，捉弄我。我想她们这是在奚落我吧！太可恶了。</p>
<h3>五</h3>
<p >今天大课间，我翻着《鲁迅全集》，里面的一段话引起了我的注意:</p>
<p >男女同吸着相通的空气，从这个男人的鼻孔呼出来，那个女人的鼻孔吸进去。又从那个女人的鼻孔呼出来，被另一个男人的鼻孔吸进去。混淆乾坤，实在比海水只触着皮肤更为严重。对于这一个严重的问题倘没有办法，男女的界限就永远分不清。</p>
<h3>六</h3>
<p >最近几天，班主任总在强调纪律问题，而且侧重说了男女问题。每次说的时候还时不时看我几眼。我有点心慌，他是在暗示我我的纪律方面有问题吗？是&ldquo;男女交往过密&rdquo;吗？自从那件事之后，我就尽量减少了与女生的接触，但是即便如此，也总难免与她们有所接触。比如，有一次上厕所回教室的路上，我被一个女生从背后拍了一下肩膀；还有一次，我借一本书给一个女生，不小心碰到了她的手指；以及有一次，我擦黑板的时候，被一个女生碰了一下背。天啊！我居然在不知不觉中与女生有了这么多接触。我有点害怕，我会不会受罚？</p>
<h3>七</h3>
<p >今天在升旗仪式上，政教处主任提出要严抓&ldquo;男女交往过密&rdquo;的违法犯罪行为。我心里不禁咯噔一下，这是要杀鸡儆猴吗？最近&ldquo;男女交往过密&rdquo;这个名词在学校的各种通知和会议上出现的频率越来越高，我很想说我已经诚心悔悟并且永不再犯了，却没有人告诉我具体的&ldquo;男女交往过密&rdquo;是个怎么样的标准。上课时离我最近的女生在两张课桌的距离之外，我不知道这算不算过密。但如果这算过密的话，杨AA的同桌就是女生，为什么他没有过密呢？我唯一可能比他过密的时候就是英语课的时候，英语老师总是有意无意靠着我的课桌给大家讲课。虽然同学们都说她是个美女，但是我却越来越讨厌她，因为她这样跟我过密分明想让我受罚！</p>
<h3>八</h3>
<p style="font-family: 正楷,sans-serif;">这两天我都没有睡好。今天大课间时，我趴在桌子上睡觉。突然，有人叫醒我，说年级长有事找我。我顿时心里一紧，不知道级长为什么找我，难道他又看到了什么？是回厕所那次？还是借书那次？或者是擦黑板那次？难道是英语老师在陷害我？我来不及多想，起身便往外走。情急之中脚不小心踢了一下桌子腿，抽屉里面的《鲁迅全集》掉了出来，书页打开到其中一页，那是《狂人日记》。我看到那最后一句话:</p>
<p style="padding-left: 24px; font-family: 方正行楷,sans-serif;">救救孩子！</p>
<p style="margin-top: 46px;">2012-4-9</p>
<p style="font-family: 正楷,sans-serif;">16:00</p>
<p style="font-family: 正楷,sans-serif;">旃檀</p>`,
        createTime: "2022-7-22 20:12:28",
        category: "未分类",
        tags: ["标签1", "T2"]
    }
})
const comput_content = computed(() =>
    data.article.content.slice(0, data.article.content.indexOf('<br>'))
)
const { article } = { ...toRefs(data) }
</script>
<style scoped lang="less">
article {
    text-align: left;

    main {
        font-family: Merriweather, Georgia, serif;
    }

    footer {
        span.continue_reading {
            color: #4791e6 !important;
            text-decoration: underline;
            font-family: Merriweather, Georgia, serif;
            font-weight: 600;
            display: block;
        }

        .article_info {
            display: flex;
            margin-top: 1rem;

            div {
                display: inline-flex;
                align-items: center;
                margin-right: .5rem;

                svg {
                    width: 1rem;
                    height: 1rem;
                    fill: #eff0f1;
                    margin-right: .2rem;
                }

                span {
                    display: inline-block;
                    line-height: .8rem;
                    font-size: .8rem;
                    margin-right: .1rem;
                }
            }
        }
    }
}
</style>